# =============================================================================
# Brewfile — 0xOrOi0x/dotfiles · Multi-Agent Dev Stack v3.1
# -----------------------------------------------------------------------------
# Standalone usage: brew bundle install --file=./Brewfile
# Auto-installed by bootstrap.sh
# =============================================================================

# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"           # AeroSpace

# =============================================================================
# 🐚 Shell & Terminal Core
# =============================================================================
brew "zsh"
brew "tmux"
brew "starship"
brew "zoxide"
brew "atuin"                     # encrypted shell history sync
brew "direnv"                    # per-project env
brew "mise"                      # runtime version manager

# =============================================================================
# 🛠️ Modern CLI Replacements
# =============================================================================
brew "lsd"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "git-delta"
brew "btop"
brew "dust"
brew "duf"
brew "fastfetch"
brew "neovim"
brew "lazygit"
brew "navi"
brew "glow"
brew "tokei"
brew "hyperfine"
brew "jless"
brew "httpie"
brew "gron"
brew "jq"
brew "yq"
brew "watch"

# =============================================================================
# 🌿 Git & GitHub
# =============================================================================
brew "git"
brew "gh"
brew "git-lfs"
brew "gnupg"

# =============================================================================
# 🤖 AI Agents (Gemini via brew; Claude/Codex via bootstrap)
# =============================================================================
brew "gemini-cli"

# =============================================================================
# 📜 Dotfiles & Reproducibility
# =============================================================================
brew "chezmoi"

# =============================================================================
# 🎨 Documentation & Presentation
# =============================================================================
brew "marp-cli"
brew "pandoc"
brew "mermaid-cli"

# =============================================================================
# 🔧 System Utilities
# =============================================================================
brew "mas"
brew "trash"
brew "wget"
brew "coreutils"
brew "tree"

# =============================================================================
# 📦 Build & Runtimes (mise overrides; these are fallbacks)
# =============================================================================
brew "bun"
brew "pnpm"
brew "uv"

# =============================================================================
# 👻 GUI Apps (Casks)
# =============================================================================
cask "ghostty"                   # GPU-accelerated terminal
cask "aerospace"                 # i3-like tiling WM
cask "raycast"                   # Spotlight + AI launcher
cask "karabiner-elements"        # keyboard remapping
cask "orbstack"                  # Docker Desktop alternative
cask "1password"                 # password manager
cask "1password-cli"             # op CLI
cask "bruno"                     # API testing (git-friendly)
cask "visual-studio-code"

# =============================================================================
# 🔤 Fonts (Nerd + CJK fallback)
# =============================================================================
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-cjk-kr"
