# =============================================================================
# Brewfile — 0xOrOi0x/dotfiles · 100% OSS Multi-Agent Stack v3.3
# -----------------------------------------------------------------------------
# All tools are verified OSS (excluding AI agents which user supplies)
# =============================================================================

# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"

# =============================================================================
# 🐚 Shell & Terminal Core (all OSS)
# =============================================================================
brew "zsh"                       # MIT
brew "tmux"                      # ISC
brew "starship"                  # ISC
brew "zoxide"                    # MIT
brew "atuin"                     # MIT
brew "direnv"                    # MIT
brew "mise"                      # MIT

# =============================================================================
# 🛠️ Modern CLI (all OSS, all Rust/Go)
# =============================================================================
brew "lsd"                       # Apache-2.0
brew "bat"                       # Apache-2.0/MIT
brew "fd"                        # Apache-2.0/MIT
brew "ripgrep"                   # Unlicense/MIT
brew "fzf"                       # MIT
brew "git-delta"                 # MIT
brew "btop"                      # Apache-2.0
brew "dust"                      # Apache-2.0
brew "duf"                       # MIT
brew "fastfetch"                 # MIT
brew "neovim"                    # Apache-2.0
brew "lazygit"                   # MIT
brew "navi"                      # Apache-2.0
brew "glow"                      # MIT
brew "tokei"                     # Apache-2.0/MIT
brew "hyperfine"                 # Apache-2.0/MIT
brew "jless"                     # MIT
brew "httpie"                    # BSD-3
brew "gron"                      # MIT
brew "jq"                        # MIT
brew "yq"                        # MIT
brew "watch"                     # GPL-2

# =============================================================================
# 🌿 Git & GitHub (all OSS)
# =============================================================================
brew "git"                       # GPL-2
brew "gh"                        # MIT
brew "git-lfs"                   # MIT
brew "gnupg"                     # GPL-3

# =============================================================================
# 🔐 Secrets & SSH (OSS replacements for 1Password)
# =============================================================================
brew "bitwarden-cli"             # GPL-3 (replaces op CLI)

# =============================================================================
# 📜 Dotfiles & Reproducibility
# =============================================================================
brew "chezmoi"                   # MIT

# =============================================================================
# 🎨 Documentation
# =============================================================================
brew "marp-cli"                  # MIT
brew "pandoc"                    # GPL-2
brew "mermaid-cli"               # MIT

# =============================================================================
# 🐳 Containers (100% OSS — Docker Engine + Colima)
# =============================================================================
brew "docker"                    # Apache-2.0 (CLI only, OSS)
brew "docker-compose"            # Apache-2.0
brew "colima"                    # MIT (replaces Docker Desktop GUI)

# =============================================================================
# 🔧 System Utilities
# =============================================================================
brew "mas"                       # MIT
brew "trash"                     # MIT
brew "wget"                      # GPL-3
brew "coreutils"                 # GPL-3
brew "tree"                      # GPL-2

# =============================================================================
# 📦 Build & Runtimes
# =============================================================================
brew "bun"                       # MIT (Apple Silicon only, removed for Intel)
brew "pnpm"                      # MIT
brew "uv"                        # MIT

# =============================================================================
# 👻 GUI Apps (verified OSS or true freeware)
# =============================================================================
cask "ghostty"                   # MIT (OSS)
cask "aerospace"                 # MIT (OSS)
# Raycast removed - replaced by Hammerspoon + Alfred
cask "alfred"                    # Freeware (free tier, no Powerpack)
cask "hammerspoon"               # MIT (OSS) - Lua scripting
cask "karabiner-elements"        # Public Domain (OSS)
cask "bitwarden"                 # GPL-3 (replaces 1Password)
cask "hoppscotch"                # MIT (replaces Bruno)
cask "visual-studio-code"        # User chose to keep (MIT codebase, MS binary)

# =============================================================================
# 🔤 Fonts (all OSS or freeware)
# =============================================================================
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-cjk-kr"
